import random

random_responses = ["কেন হতা? এগিন কেন হতা বদ্দা। তার ফর তোয়াই কি হইয়ো?",
                    "আইচ্ছা। তার ফর হ বদ্দা।",
                    "আত্তারমারেবাপ।  আই ত হইত ও নো ফারি।",
                    "আজিয়া বদ্দা গম লার। পরিবেশ আন এক্কানা আজিয়ে ভালা আছে।",
                    "বাদ দো। বদ্দা আর হুইনতো মনে ন হর। নোয়া কিছু হ বদ্দা।",
                    "হালিয়া খেলা চাইল না? বদ্দা।",
                    "বদ্দা! হালিয়া মেজ্জান এক্কান আছে। আর ফোয়ারে যাইবা না?",
                    "হালিয়া বদ্দা বইঙ্গা ফুয়া উগ্গার লয় হতা হইয়ে। হিতে সুদ্দানির ফোয়াই বলে উনি ন হাই।"
                    ]

print("বদ্দা! আই আর ভাইনা তূর্য দত্ত'র এআই বট হইদ্দি।")
print("তোয়াই হতা হইবের ফরে 'enter' টিপ দিও মনত গরি।")
print("তোয়ার হতা ফুরাইলে 'bye' হইবা যে এরি। বুইজ্জনা?")
username = input("তোয়ার নাম আন হ চাই বদ্দা: ")
print("এহন হ বদ্দা তোয়াই কেন আছো আগে ইয়ান হ?")

while True:
    user_input = input(f"{username}:  ")
    if user_input.lower() == "bye":
        
        break
    else:
        response = random.choices(random_responses)[0]
    print(f"মামু: {response}")

print("আইচ্ছা বদ্দা, আই যাইর গুই। আল্লাহাফেজ!")